/*******************************************************************************
* タイトル	:プレイヤー.h
* ファイル名:AfBackGround2.h
* 作成者	:田村春樹
* 作成日	:2015/05/29
********************************************************************************
* 更新履歴	ver 1.00
*******************************************************************************/
#ifndef _AF_AF_BACKGROUND2_H_
#define _AF_AF_BACKGROUND2_H_
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"
#include "afPointConvert.h"
/*******************************************************************************
* マクロ定義
*******************************************************************************/


/*******************************************************************************
* 構造体定義
*******************************************************************************/


/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/

/*******************************************************************************
* 関数名	:HRESULT InitAfBackGround2( void )
*		プレイヤー初期化関数です。
* 引数		:void 引数なし
* 戻り値	:HRESULT 関数の実行結果
* 説明		:変数等の初期化を実行する起動毎に一度のみ動作する関数です。
*******************************************************************************/
HRESULT InitAfBackGround2( void );

/*******************************************************************************
* 関数名	:HRESULT InitDirectAfBackGround2( void )
*		プレイヤー初期化関数です。
* 引数		:void 引数なし
* 戻り値	:HRESULT 関数の実行結果
* 説明		:変数等の初期化を実行する起動毎に一度のみ動作する関数です。
*******************************************************************************/
HRESULT InitDirectAfBackGround2( void );

/*******************************************************************************
* 関数名	:HRESULT InitValueAfBackGround2( void )
*		プレイヤー初期化関数です。
* 引数		:void 引数なし
* 戻り値	:HRESULT 関数の実行結果
* 説明		:変数等の初期化を実行する起動毎に一度のみ動作する関数です。
*******************************************************************************/
void InitValueAfBackGround2( void );

/*******************************************************************************
* 関数名	:void UninitAfBackGround2( void )
*		プレイヤー終了処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:終了時に実行する関数を内包する関数で終了時に一度のみ動作。
*******************************************************************************/
void UninitAfBackGround2( void );

/*******************************************************************************
* 関数名	:void UpdateAfBackGround2( void )
*		プレイヤー更新処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:処理周回毎の処理内容を記述します。実質的なメイン関数です。
*******************************************************************************/
void UpdateAfBackGround2( void );

/*******************************************************************************
* 関数名	:void DrawAfBackGround2( void )
*		プレイヤー描画処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:画面出力に関わる処理を内包します。
*******************************************************************************/
void DrawAfBackGround2( void );

/*******************************************************************************
* 関数名	:void DrawAfBackGround2core( void )
*		プレイヤー描画処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:画面出力に関わる処理を内包します。
*******************************************************************************/
void DrawAfBackGround2core( void );

#endif