/*******************************************************************************
* タイトル	:自弾.h
* ファイル名:AfBulletPlayer.h
* 作成者	:田村春樹
* 作成日	:2015/05/29
********************************************************************************
* 更新履歴	ver 1.00
*******************************************************************************/
#ifndef _AF_BULLET_PLAYER_H_
#define _AF_BULLET_PLAYER_H_
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"
#include "afPointConvert.h"
/*******************************************************************************
* マクロ定義
*******************************************************************************/

#define BULLET_PLAYER_MAX_NUM	( 100 )	//自弾の数
#define BULLET_PLAYER_RADIUS	( 10 )	//当たり判定

typedef enum
{
	BULLET_PLAYER_MODE_NORMAL = 0,
	BULLET_PLAYER_MODE_DAMAGE,
	BULLET_PLAYER_MODE_HYPERMODE,
	BULLET_PLAYER_MODE_OVERHEAT,
	BULLET_PLAYER_MODE_START,
	BULLET_PLAYER_MODE_MAX
}BULLET_PLAYER_MODE;


/*******************************************************************************
* 構造体定義
*******************************************************************************/
typedef struct
{
	bool bUse;
	AF_OBJECT_STATUS posStatus;
	float moveZ;
	float posZ;
	int intPosX;
	int intPosY;
	int nLife;
}BULLET_PLAYER_STATUS;

/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/

/*******************************************************************************
* 関数名	:HRESULT InitAfBulletPlayer( void )
*		自弾初期化関数です。
* 引数		:void 引数なし
* 戻り値	:HRESULT 関数の実行結果
* 説明		:変数等の初期化を実行する起動毎に一度のみ動作する関数です。
*******************************************************************************/
HRESULT InitAfBulletPlayer( void );

/*******************************************************************************
* 関数名	:HRESULT InitDirectAfBulletPlayer( void )
*		自弾初期化関数です。
* 引数		:void 引数なし
* 戻り値	:HRESULT 関数の実行結果
* 説明		:変数等の初期化を実行する起動毎に一度のみ動作する関数です。
*******************************************************************************/
HRESULT InitDirectAfBulletPlayer( void );

/*******************************************************************************
* 関数名	:HRESULT InitValueAfBulletPlayer( void )
*		自弾初期化関数です。
* 引数		:void 引数なし
* 戻り値	:HRESULT 関数の実行結果
* 説明		:変数等の初期化を実行する起動毎に一度のみ動作する関数です。
*******************************************************************************/
void InitValueAfBulletPlayer( void );

/*******************************************************************************
* 関数名	:void UninitAfBulletPlayer( void )
*		自弾終了処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:終了時に実行する関数を内包する関数で終了時に一度のみ動作。
*******************************************************************************/
void UninitAfBulletPlayer( void );

/*******************************************************************************
* 関数名	:void UpdateAfBulletPlayer( void )
*		自弾更新処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:処理周回毎の処理内容を記述します。実質的なメイン関数です。
*******************************************************************************/
void UpdateAfBulletPlayer( void );

/*******************************************************************************
* 関数名	:void DrawAfBulletPlayer( void )
*		自弾描画処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:画面出力に関わる処理を内包します。
*******************************************************************************/
void DrawAfBulletPlayer( void );

/*******************************************************************************
* 関数名	:void DrawAfBulletPlayercore( void )
*		自弾描画処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:画面出力に関わる処理を内包します。
*******************************************************************************/
void DrawAfBulletPlayercore( void );

/*******************************************************************************
* 関数名	:BULLET_PLAYER_STATUS* GetBulletPlayerState( int num )
*		自弾のステータスを取得します。
* 引数		:int num	入手する構造体の番号
* 戻り値	:void 戻り値なし
* 説明		:自弾のステータスを取得します。。
*******************************************************************************/
BULLET_PLAYER_STATUS* GetBulletPlayerState( int num );

/*******************************************************************************
* 関数名	:BULLET_PLAYER_STATUS* GetBulletPlayerState( int num )
*		自弾のステータスを取得します。
* 引数		:int num	入手する構造体の番号
* 戻り値	:void 戻り値なし
* 説明		:自弾のステータスを取得します。。
*******************************************************************************/
void SetBulletPlayerState( float posX , float posY , float posZ , float moveZ );

#endif