/*******************************************************************************
* タイトル	:コンボ数.h
* ファイル名:afComboNumber.h
* 作成者	:田村春樹
* 作成日	:2015/06/24
********************************************************************************
* 更新履歴	ver 1.00
*******************************************************************************/
#ifndef _AF_COMBONUMBER_H_
#define _AF_COMBONUMBER_H_
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"
#include "game.h"

/*******************************************************************************
* マクロ定義
*******************************************************************************/

#define AF_COMBONUMBER_POS_X		( SCREEN_WIDTH * 0.95 )		//コンボ数表示位置
#define AF_COMBONUMBER_POS_Y		( 70 )

#define COLOR_FADE_RATIO	( 0.6 )	//カラーフェード適用率

#define AF_COMBO_OUTPUT_POS_X_ADJUST_PLUS	( -20 )
#define AF_COMBONUMBER_MAX					( 800000000 )	//コンボ数最大値
#define AF_COMBO_FADE_OUT					( 120 )	//AF_COMBO無効化までのカウント

#define AF_COMBONUMBER_NUMBER_OF_DIGITS	( 9 )	//コンボ数桁数
#define AF_COMBONUMBER_WIDTH	( 50 )	//コンボ数数字幅

/*******************************************************************************
* 構造体定義
*******************************************************************************/

/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/

/*******************************************************************************
* 関数名	:HRESULT InitAfComboNumber( void )
*		コンボ数初期化関数です。
* 引数		:void 引数なし
* 戻り値	:HRESULT 関数の実行結果
* 説明		:変数等の初期化を実行する起動毎に一度のみ動作する関数です。
*******************************************************************************/
HRESULT InitAfComboNumber( void );

/*******************************************************************************
* 関数名	:void UninitAfComboNumber( void )
*		コンボ数終了処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:終了時に実行する関数を内包する関数で終了時に一度のみ動作。
*******************************************************************************/
void UninitAfComboNumber( void );

/*******************************************************************************
* 関数名	:void UpdateAfComboNumber( void )
*		コンボ数更新処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:処理周回毎の処理内容を記述します。実質的なメイン関数です。
*******************************************************************************/
void UpdateAfComboNumber( void );

/*******************************************************************************
* 関数名	:void DrawAfComboNumber( void )
*		コンボ数描画処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:画面出力に関わる処理を内包します。
*******************************************************************************/
void DrawAfComboNumber( void );

/*******************************************************************************
* 関数名	:void DrawAfComboNumber2( void )
*		コンボ数の加算描画処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:画面出力に関わる処理を内包します。
*******************************************************************************/
void DrawAfComboNumber2( void );

/*******************************************************************************
* 関数名	:void PlusAfComboNumber( int plusNum )
*		コンボ数加算関数です。
* 引数		:int plusNum	加算値
* 戻り値	:void 戻り値なし
* 説明		:コンボ数を加算します。
*******************************************************************************/
void PlusAfComboNumber( int plusNum );

/*******************************************************************************
* 関数名	:int GetAfComboNumber( void )
*		コンボ数取得関数です。
* 引数		:void 引数無し
* 戻り値	:int g_nowAfComboNum	現在のコンボ数
* 説明		:コンボ数を加算します。
*******************************************************************************/
int GetAfComboNumber( void );

/*******************************************************************************
* 関数名	:int GetAfComboNum( void )
*		コンボ数フェード値取得関数です。
* 引数		:void 引数無し
* 戻り値	:int g_fadeNum	現在のコンボ数フェード値
* 説明		:コンボ数を加算します。
*******************************************************************************/
int GetFadeAfComboNum( void );

/*******************************************************************************
* 関数名	:resetAfComboNumber( int resetNum )
*		コンボ数リセット関数です。
* 引数		:int resetNum	リセット後の値
* 戻り値	:void 戻り値なし
* 説明		:コンボ数をリセットします。
*******************************************************************************/
void resetAfComboNumber( int resetNum );

#endif