/*******************************************************************************
* タイトル	:カーソル.h
* ファイル名:AfPauseButton.h
* 作成者	:田村春樹
* 作成日	:2015/05/29
********************************************************************************
* 更新履歴	ver 1.00
*******************************************************************************/
#ifndef _AF_PAUSEBUTTON_H_
#define _AF_PAUSEBUTTON_H_
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"
#include "afPointConvert.h"
/*******************************************************************************
* マクロ定義
*******************************************************************************/

#define PAUSEBUTTON_RADIUS ( 5000 )	//当たり判定

typedef enum
{
	PAUSEBUTTON_MODE_NORMAL = 0,
	PAUSEBUTTON_MODE_SELECT,
	PAUSEBUTTON_MODE_MAX
}PAUSEBUTTON_MODE;

/*******************************************************************************
* 構造体定義
*******************************************************************************/
typedef struct
{
	AF_OBJECT_STATUS posStatus;
	int intPosX;
	int intPosY;
	PAUSEBUTTON_MODE mode;
}PAUSEBUTTON;

/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/

/*******************************************************************************
* 関数名	:HRESULT InitAfPauseButton( void )
*		カーソル初期化関数です。
* 引数		:void 引数なし
* 戻り値	:HRESULT 関数の実行結果
* 説明		:変数等の初期化を実行する起動毎に一度のみ動作する関数です。
*******************************************************************************/
HRESULT InitAfPauseButton( void );

/*******************************************************************************
* 関数名	:HRESULT InitDirectAfPauseButton( void )
*		カーソル初期化関数です。
* 引数		:void 引数なし
* 戻り値	:HRESULT 関数の実行結果
* 説明		:変数等の初期化を実行する起動毎に一度のみ動作する関数です。
*******************************************************************************/
HRESULT InitDirectAfPauseButton( void );

/*******************************************************************************
* 関数名	:HRESULT InitValueAfPauseButton( void )
*		カーソル初期化関数です。
* 引数		:void 引数なし
* 戻り値	:HRESULT 関数の実行結果
* 説明		:変数等の初期化を実行する起動毎に一度のみ動作する関数です。
*******************************************************************************/
void InitValueAfPauseButton( void );

/*******************************************************************************
* 関数名	:void UninitAfPauseButton( void )
*		カーソル終了処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:終了時に実行する関数を内包する関数で終了時に一度のみ動作。
*******************************************************************************/
void UninitAfPauseButton( void );

/*******************************************************************************
* 関数名	:void UpdateAfPauseButton( void )
*		カーソル更新処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:処理周回毎の処理内容を記述します。実質的なメイン関数です。
*******************************************************************************/
void UpdateAfPauseButton( void );

/*******************************************************************************
* 関数名	:void DrawAfPauseButton( void )
*		カーソル描画処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:画面出力に関わる処理を内包します。
*******************************************************************************/
void DrawAfPauseButton( void );

#endif