/*******************************************************************************
* タイトル	:背景.h
* ファイル名:afPointConvert.h
* 作成者	:田村春樹
* 作成日	:2015/05/29
********************************************************************************
* 更新履歴	ver 1.00
*******************************************************************************/
#ifndef _AF_POINTCONVERTER_H_
#define _AF_POINTCONVERTER_H_
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"

/*******************************************************************************
* マクロ定義
*******************************************************************************/

/*******************************************************************************
* 構造体定義
*******************************************************************************/
typedef struct
{
	float centerVector;
	float centerPosX;
	float centerPosY;
	float EnemyPopPosX;
	float EnemyPopPosY;
}AF_VIEW_STATUS;

typedef struct
{
	float posX;
	float posY;
	float vector;
	
	float DrawPosX;
	float DrawPosY;
	float DrawVector; 
}AF_OBJECT_STATUS;

/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/

/*******************************************************************************
* 関数名	:HRESULT InitBack( void )
*		背景初期化関数です。
* 引数		:void 引数なし
* 戻り値	:HRESULT 関数の実行結果
* 説明		:変数等の初期化を実行する起動毎に一度のみ動作する関数です。
*******************************************************************************/
HRESULT InitAfPointConvert( void );

/*******************************************************************************
* 関数名	:HRESULT InitDirectAfPointConvert( void )
*		背景初期化関数です。
* 引数		:void 引数なし
* 戻り値	:HRESULT 関数の実行結果
* 説明		:変数等の初期化を実行する起動毎に一度のみ動作する関数です。
*******************************************************************************/
HRESULT InitDirectAfPointConvert( void );

/*******************************************************************************
* 関数名	:HRESULT InitValueAfPointConvert( void )
*		背景初期化関数です。
* 引数		:void 引数なし
* 戻り値	:HRESULT 関数の実行結果
* 説明		:変数等の初期化を実行する起動毎に一度のみ動作する関数です。
*******************************************************************************/
void InitValueAfPointConvert( void );

/*******************************************************************************
* 関数名	:void UninitBack( void )
*		背景終了処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:終了時に実行する関数を内包する関数で終了時に一度のみ動作。
*******************************************************************************/
void UninitAfPointConvert( void );

/*******************************************************************************
* 関数名	:void UpdateBack( void )
*		背景更新処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:処理周回毎の処理内容を記述します。実質的なメイン関数です。
*******************************************************************************/
void UpdateAfPointConvert( void );

/*******************************************************************************
* 関数名	:void DrawBack( void )
*		背景描画処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:画面出力に関わる処理を内包します。
*******************************************************************************/
void DrawAfPointConvert( void );

/*******************************************************************************
* 関数名	:AF_VIEW_STATUS* getViewStatus( void )
*		ビュー情報構造体を渡す処理関数です。
* 引数		:void 引数なし
* 戻り値	:AF_VIEW_STATUS*　g_NowViewStatusのアドレス
* 説明		:ビュー情報構造体を渡す関数です。
*******************************************************************************/
AF_VIEW_STATUS* getViewStatus( void );

#endif