/*******************************************************************************
* タイトル	:スコア.h
* ファイル名:afScoreMy.h
* 作成者	:田村春樹
* 作成日	:2015/06/24
********************************************************************************
* 更新履歴	ver 1.00
*******************************************************************************/
#ifndef _AF_SCORE_MY_H_
#define _AF_SCORE_MY_H_
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"
#include "game.h"

/*******************************************************************************
* マクロ定義
*******************************************************************************/



/*******************************************************************************
* 構造体定義
*******************************************************************************/

/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/

/*******************************************************************************
* 関数名	:HRESULT InitAfScoreMy( void )
*		スコア初期化関数です。
* 引数		:void 引数なし
* 戻り値	:HRESULT 関数の実行結果
* 説明		:変数等の初期化を実行する起動毎に一度のみ動作する関数です。
*******************************************************************************/
HRESULT InitAfScoreMy( void );

/*******************************************************************************
* 関数名	:void UninitAfScoreMy( void )
*		スコア終了処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:終了時に実行する関数を内包する関数で終了時に一度のみ動作。
*******************************************************************************/
void UninitAfScoreMy( void );

/*******************************************************************************
* 関数名	:void UpdateAfScoreMy( void )
*		スコア更新処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:処理周回毎の処理内容を記述します。実質的なメイン関数です。
*******************************************************************************/
void UpdateAfScoreMy( void );

/*******************************************************************************
* 関数名	:void DrawAfScoreMy( void )
*		スコア描画処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:画面出力に関わる処理を内包します。
*******************************************************************************/
void DrawAfScoreMy( void );

/*******************************************************************************
* 関数名	:void PlusAfScoreMy( long plusNum )
*		スコア加算関数です。
* 引数		:long plusNum	加算値
* 戻り値	:void 戻り値なし
* 説明		:スコアを加算します。
*******************************************************************************/
void PlusAfScoreMy( long plusNum );

/*******************************************************************************
* 関数名	:resetAfScoreMy( unsigned long resetNum )
*		スコアリセット関数です。
* 引数		:unsigned long	リセット後の値
* 戻り値	:void 戻り値なし
* 説明		:スコアをリセットします。
*******************************************************************************/
void resetAfScoreMy( unsigned long resetNum );

/*******************************************************************************
* 関数名	:unsigned long  getAfScoreMy( void )
*		スコアゲット関数です。
* 引数		:void	引数なし
* 戻り値	:unsigned long nowAfScoreMy	現在のスコア
* 説明		:スコアを取得します。
*******************************************************************************/
unsigned long getAfScoreMy( void );

#endif