/*******************************************************************************
* タイトル	:コンボ数.h
* ファイル名:comboNumber.h
* 作成者	:田村春樹
* 作成日	:2015/06/24
********************************************************************************
* 更新履歴	ver 1.00
*******************************************************************************/
#ifndef _COMBONUMBER_H_
#define _COMBONUMBER_H_
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"
#include "game.h"

/*******************************************************************************
* マクロ定義
*******************************************************************************/

#define COMBONUMBER_POS_X		( FIELD_WIDTH / 2 + FIELD_LEFT )		//コンボ数表示位置
#define COMBONUMBER_POS_Y		( 35 )

#define COLOR_FADE_RATIO	( 0.6 )	//カラーフェード適用率

#define COMBO_OUTPUT_POS_X_ADJUST_PLUS	( -20 )
#define COMBONUMBER_MAX					( 800000000 )	//コンボ数最大値
#define COMBO_FADE_OUT					( 300 )	//COMBO無効化までのカウント

#define COMBONUMBER_NUMBER_OF_DIGITS	( 9 )	//コンボ数桁数
#define COMBONUMBER_WIDTH	( 50 )	//コンボ数数字幅

/*******************************************************************************
* 構造体定義
*******************************************************************************/

/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/

/*******************************************************************************
* 関数名	:HRESULT InitComboNumber( void )
*		コンボ数初期化関数です。
* 引数		:void 引数なし
* 戻り値	:HRESULT 関数の実行結果
* 説明		:変数等の初期化を実行する起動毎に一度のみ動作する関数です。
*******************************************************************************/
HRESULT InitComboNumber( void );

/*******************************************************************************
* 関数名	:void UninitComboNumber( void )
*		コンボ数終了処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:終了時に実行する関数を内包する関数で終了時に一度のみ動作。
*******************************************************************************/
void UninitComboNumber( void );

/*******************************************************************************
* 関数名	:void UpdateComboNumber( void )
*		コンボ数更新処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:処理周回毎の処理内容を記述します。実質的なメイン関数です。
*******************************************************************************/
void UpdateComboNumber( void );

/*******************************************************************************
* 関数名	:void DrawComboNumber( void )
*		コンボ数描画処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:画面出力に関わる処理を内包します。
*******************************************************************************/
void DrawComboNumber( void );

/*******************************************************************************
* 関数名	:void DrawComboNumber2( void )
*		コンボ数の加算描画処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:画面出力に関わる処理を内包します。
*******************************************************************************/
void DrawComboNumber2( void );

/*******************************************************************************
* 関数名	:void PlusComboNumber( int plusNum )
*		コンボ数加算関数です。
* 引数		:int plusNum	加算値
* 戻り値	:void 戻り値なし
* 説明		:コンボ数を加算します。
*******************************************************************************/
void PlusComboNumber( int plusNum );

/*******************************************************************************
* 関数名	:int GetComboNumber( void )
*		コンボ数取得関数です。
* 引数		:void 引数無し
* 戻り値	:int g_nowComboNum	現在のコンボ数
* 説明		:コンボ数を加算します。
*******************************************************************************/
int GetComboNumber( void );

/*******************************************************************************
* 関数名	:int GetComboNum( void )
*		コンボ数フェード値取得関数です。
* 引数		:void 引数無し
* 戻り値	:int g_fadeNum	現在のコンボ数フェード値
* 説明		:コンボ数を加算します。
*******************************************************************************/
int GetFadeComboNum( void );

/*******************************************************************************
* 関数名	:resetComboNumber( int resetNum )
*		コンボ数リセット関数です。
* 引数		:int resetNum	リセット後の値
* 戻り値	:void 戻り値なし
* 説明		:コンボ数をリセットします。
*******************************************************************************/
void resetComboNumber( int resetNum );

#endif