/*******************************************************************************
* タイトル	:爆発.h
* ファイル名:explosion.h
* 作成者	:田村春樹
* 作成日	:2015/06/24
********************************************************************************
* 更新履歴	ver 1.00
*******************************************************************************/
#ifndef _EXPLOSION_H_
#define _EXPLOSION_H_
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"
#include "game.h"

/*******************************************************************************
* マクロ定義
*******************************************************************************/
#define EXPLOSION_MAX			( 1000 )
typedef enum
{
	EXPLOSION_001 = 0,
	EXPLOSION_002,
	EXPLOSION_003,
	EXPLOSION_004,
	EXPLOSION_TYPE_MAX
}EXPLOSION_TYPE;
/*******************************************************************************
* 構造体定義
*******************************************************************************/

/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/

/*******************************************************************************
* 関数名	:HRESULT InitExplosion( void )
*		爆発初期化関数です。
* 引数		:void 引数なし
* 戻り値	:HRESULT 関数の実行結果
* 説明		:変数等の初期化を実行する起動毎に一度のみ動作する関数です。
*******************************************************************************/
HRESULT InitExplosion( void );

/*******************************************************************************
* 関数名	:void UninitExplosion( void )
*		爆発終了処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:終了時に実行する関数を内包する関数で終了時に一度のみ動作。
*******************************************************************************/
void UninitExplosion( void );

/*******************************************************************************
* 関数名	:void UpdateExplosion( void )
*		爆発更新処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:処理周回毎の処理内容を記述します。実質的なメイン関数です。
*******************************************************************************/
void UpdateExplosion( void );

/*******************************************************************************
* 関数名	:void DrawExplosion( void )
*		爆発描画処理関数です。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:画面出力に関わる処理を内包します。
*******************************************************************************/
void DrawExplosion( void );

/*******************************************************************************
* 関数名	:void SetExplosion( D3DXVECTOR3 pos , D3DXVECTOR3 vecMove , int nLife , ENEMY_TYPE type )
*		爆発を生成する関数です。
* 引数		:D3DXVECTOR3 pos		爆発の出現位置です。
*			 D3DXVECTOR3 vecMove	爆発の移動量です。
*			 int nLife				爆発の寿命です。
*			(ENEMY_TYPE type		爆発の種類です。)	
* 戻り値	:void 戻り値なし
* 説明		:画面出力に関わる処理を内包します。
*******************************************************************************/
void SetExplosion( int posX , int posY , int posZrot , int moveX , int moveY , int moveZrot , int nLife , EXPLOSION_TYPE type );
#endif