/*******************************************************************************
* タイトル	:自作DirectX便利系header
* ファイル名:unoDirectX.h
* 作成者	:田村春樹
* 作成日	:2015/07/03
********************************************************************************
* 更新履歴	ver 1.00 おおよその完成
*
*******************************************************************************/
#ifndef _UNODIRECTX_H_
#define _UNODIRECTX_H_

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"


/*******************************************************************************
* マクロ定義
*******************************************************************************/
#define QUOTE_VERTEX	( 4 )
#define TRIANGLE_VERTEX ( 3 )


/*******************************************************************************
* 関数名	:void vertexInit( VERTEX_2D *p_vertex , int vertexNum )
*		VERTEX_2D、頂点バッファの値を初期化します。
* 引数		:VERTEX_2D *p_vertex	初期化するバッファの先頭アドレス	
*			 int vertexNum			初期化する頂点数
* 戻り値	:void 戻り値なし
* 説明		:VERTEX_2Dの値を初期化します。
*******************************************************************************/
void vertexInit( VERTEX_2D *p_vertex , int vertexNum );

/*******************************************************************************
* 関数名	:void vertexInitQuad( VERTEX_2D *p_vertex , int polygonNum )
*		VERTEX_2D、頂点バッファの値をポリゴン単位で初期化します。
* 引数		:VERTEX_2D *p_vertex	初期化するバッファの先頭アドレス	
*			 int vertexNum			初期化する頂点数
* 戻り値	:void 戻り値なし
* 説明		:VERTEX_2Dの値をポリゴン単位で初期化します。
*******************************************************************************/
void vertexInitQuad( VERTEX_2D *p_vertex , int polygonNum );

#endif