/*******************************************************************************
* タイトル	:自作math関数header
* ファイル名:unoMath.h
* 作成者	:田村春樹
* 作成日	:2014/12/26
********************************************************************************
* 更新履歴	ver 1.00 おおよその完成
*
*******************************************************************************/
#ifndef _UNOMATH_H_
#define _UNOMATH_H_

/*******************************************************************************
* 関数名	:void unoSin( double sinAngleX )
*		sinの計算を行います。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:sinAngleXに渡された角度のsinを求めます。
*******************************************************************************/
double unoSin( double sinAngleX );

/*******************************************************************************
* 関数名	:void unoSinRad( double sinAngleX )
*		sinの計算を行います。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:sinAngleXに渡された角度のsinを求めます。（弧度法）
*******************************************************************************/
double unoSinRad( double sinAngleX );

/*******************************************************************************
* 関数名	:void unoCos( double sinAngleX )
*		cosの計算を行います。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:cosAngleXに渡された角度のcosを求めます。
*******************************************************************************/
double unoCos( double cosAngleX );

/*******************************************************************************
* 関数名	:void unoSinRad( double sinAngleX )
*		sinの計算を行います。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:sinAngleXに渡された角度のsinを求めます。（弧度法）
*******************************************************************************/
double unoCosRad( double cosAngleX );

/*******************************************************************************
* 関数名	:void unoSqrt( double a )
*		sinの計算を行います。
* 引数		:void 引数なし
* 戻り値	:void 戻り値なし
* 説明		:sinAngleXに渡された角度のsinを求めます。（弧度法）
*******************************************************************************/
double unoSqrt( double a );

/*******************************************************************************
* 関数名	:int unoExp( int baseNumber , int multiplier )
*				べき乗処理関数
* 引数		:int baseNumber	基数部
*			 int multiplier	乗数部
* 戻り値	:正常終了:float型	べき乗の演算結果
* 説明		:べき乗処理関数です。
*******************************************************************************/
int unoExp( int baseNumber , int multiplier );

/*******************************************************************************
* 関数名	:double unoExpf( double baseNumber , int multiplier )
*				べき乗処理関数
* 引数		:float baseNumber	基数部
*		int multiplier	乗数部
* 戻り値	:正常終了:float型	べき乗の演算結果
* 説明		:float型用のべき乗処理関数です。
*******************************************************************************/
double unoExpf( double baseNumber , int multiplier );

/*******************************************************************************
* 関数名	:double unoRoundOffDecimal( float number , int decimalPlace )
*				小数用四捨五入関数
* 引数		:double number		四捨五入する数値
*			 int decimalPlace	小数第何位までで四捨五入するのか指定する値
* 戻り値	:正常終了:float型	四捨五入した結果
* 説明		:小数を指定桁で四捨五入します。
*******************************************************************************/
double unoRoundOffDecimal( double number , int decimalPlace );

#endif